<h1>Building a movie content based recommender using tf-idf</h1>

# Types of recommender systems


* **Content-Based**: Content based recommenders will instead use data exclusively about the items. For this we need to have a minimal understanding of the usersâ€™ preferences, so that we can then recommend new items with similar tags/keywords to those specified (or inferred) by the user.

# The MovieLens Dataset

We used **MovieLents** dataset to test our recommender systems which contains rating data sets from the MovieLens web site.

# Data Preparation

In [1]:
# import need library

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from itertools import combinations
import seaborn as sns
from wordcloud import WordCloud

In [2]:
# load data

ratings = pd.read_csv('data_set/ratings.csv', sep='\t', encoding='latin-1', usecols=['user_id', 'movie_id', 'rating'])
users = pd.read_csv('data_set/users.csv', sep='\t', encoding='latin-1', usecols=['user_id', 'gender', 'zipcode', 'age_desc', 'occ_desc'])
movies = pd.read_csv('data_set/movies.csv', sep='\t', encoding='latin-1', usecols=['movie_id', 'title', 'genres'])

rating file:

In [3]:
ratings.shape

(1000209, 3)

In [4]:
ratings.sample(5)

        user_id  movie_id  rating
82735       549      2405       3
589493     3594      2018       3
812732     4879      1967       3
433684     2643      3182       2
996759     6016      2013       2

movies file:

In [5]:
movies.shape

(3883, 3)

In [6]:
movies.sample(5)

      movie_id                      title         genres
248        251         Hunted, The (1995)         Action
1686      1735  Great Expectations (1998)  Drama|Romance
472        476        Inkwell, The (1994)   Comedy|Drama
1681      1730              Kundun (1997)          Drama
3049      3118         Tumbleweeds (1999)          Drama

users file:

In [7]:
users.shape

(6040, 5)

In [8]:
users.head()

   user_id gender zipcode  age_desc              occ_desc
0        1      F   48067  Under 18          K-12 student
1        2      M   70072       56+         self-employed
2        3      M   55117     25-34             scientist
3        4      M   02460     45-49  executive/managerial
4        5      M   55455     25-34                writer

# Data Exploration
### Ratings